cases/electrochemicalFoam/1mm_2D/constant/electrochemicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      electrochemicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

electrochemistry    on;

currentControl  false;

transportSolver concentrated;//dilute;

electrodes
(
//    anode 
//    cathode
);

anode
{
    typeName        boundaryPatchElectrode;
    patchName       currentCollector;
    currentControl  false;
    oxidant         ZnOH4--;
    reductant       OH-;
    electronNumber  2;
    exchangeCurrentDensity  1e-2;
    equilibriumPotential -0.469;
    potential       -0.340;
    currentDensity  0;
    alphaA          0.5;
    alphaC          1.0;
    sigma 	        1e7;
    stoichCoeffs
    {
        ZnOH4--     -1;
        OH-         4;
        K+          0;
        H2O         0;
    }
    reactionOrders
    {
        ZnOH4--     1;
        OH-         4;
        K+          0;
        H2O         0;
    }
    CRefs
    {
        ZnOH4--     1000;
        OH-         1000;
        K+          1000;
        H2O         1000;
    }
    resistanceModel
    {
        typeName    porousLayer;
        initialPorosity     0.1;
        initialThickness    2e-8;
        BruggemannCoeff      3.5;
    }
}

cathode
{
    typeName        boundaryPatchElectrode;
    patchName       separator;
    oxidant         OH-;
    reductant       H2O;
    electronNumber  2;
    exchangeCurrentDensity  1e-2;
    equilibriumPotential 1.2;
    phiEs           1.0;
    alphaA          0.5;
    alphaC          1.0;
    sigma 	        1e7;
    stoichCoeffs
    {
        ZnOH4--     0;
        OH-         -2;
        K+          0;
        H2O         0;
    }
    reactionOrders
    {
        ZnOH4--     0;
        OH-         2;
        K+          0;
        H2O         0;
    }
    CRefs
    {
        ZnOH4--     1000;
        OH-         1000;
        K+          1000;
        H2O         1000;
    }
    resistanceModel
    {
        typeName    porousLayer;
        initialPorosity     0.1;
        initialThickness    0;
        BruggemannCoeff      3.5;
    }
}

electrolyteModel
{
    typeName    concentratedElectrolyte<constHThermoPhysics>;
    balanceSpecies          "K+";
    inertSpecies            "H2O";
    standardConcentration   Cstd [0 -3 0 0 1 0 0] 1000;
    diffusivityModel
    {
        typeName polynomialDiff;
        ZnOH4--
        {
            referenceSpecie     K+;
            diffusivityCoeffs polynomial [0 2 -1 0 0 0 0]
            (
                (-9.33e-11 1)
                (1.2e-9 0)
            );
        }
        OH- 
        {
            referenceSpecie     K+;
            diffusivityCoeffs polynomial [0 2 -1 0 0 0 0]
            (
                (2.0e-9 0)
            );
        }
        K+ 
        {
            referenceSpecie     K+;
            diffusivityCoeffs polynomial [0 2 -1 0 0 0 0]
            (
                (1.2e-9 0)
            );
        }
        H2O 
        {
            referenceSpecie     K+;
            diffusivityCoeffs polynomial [0 2 -1 0 0 0 0]
            (
                (2.3e-9 0)
            );
        }
    }
    conductivityModel
    {
        typeName linearMixture;
        //typeName NernstPlanck;
        equivalentConductivity
        {
            K+-ZnOH4--  K+-ZnOH4--  [-1 0 3 0 -1 2 0] 7e-4;
            K+-OH-      K+-OH-      [-1 0 3 0 -1 2 0] 88e-4;
        }
    }
    transferenceNumberModel
    {
        typeName speciesConductivity;
        speciesConductivity
        {
            ZnOH4--     ZnOH4--     [-1 0 3 0 -1 2 0] 118.96e-4;
            OH-         OH-         [-1 0 3 0 -1 2 0] 197.6e-4;
            K+          K+          [-1 0 3 0 -1 2 0] 73.52e-4;
        }
    }
}


epsilonR            epsilonR [ 0 0 0 0 0 0 0 ] 25;
kappaFactor 1;

// ************************************************************************* //
