cases/electrochemicalFoam/1mm_2D/0.org/C_OH-
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.2-devel                             |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object 	C_OH-;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 0 0 1 0 0];

internalField   uniform 7000;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 7000;
        //type 		    zeroGradient;
    }
    outlet
    {
        //type            calculatedGradient;
        //value           uniform 0;
        type 		    zeroGradient;
    }
    
    currentCollector 
    {
        type            calculatedGradient;
        value           uniform 0;
    }    

    separator
    {
        type            fixedValue;
        value           uniform 7000;
        //type            calculatedGradient;
        //value           uniform 7000;
    }    

    frontAndBack 
    {
        type            empty;
    }

//    wall 
//    {
//        type            zeroGradient;
//        //type            calculatedGradient;
//        //value           uniform 0;
//    }    
}

// ************************************************************************* //
