cases/electrochemicalFoam/1mm_2D/0.org/i
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.2-devel                             |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object 	    i;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -2 0 0 0 1 0];

internalField   uniform (0.0 0.0 0.0);

boundaryField
{
    inlet
    {
        type            zeroGradient;
        //type            fixedValue;
        //value           uniform (0.0 0.0 0.0);
    }
    outlet
    {
        type            zeroGradient;
        //type            fixedValue;
        //value           uniform (0.0 0.0 0.0);
    }
    
    currentCollector
    {
        type            butlerVolmerCurrent;
        value           uniform (0 0 0);        
        electrodeName   anode;
        electricPotentialField  phiE;
        temperatureField    T;        
        oxidant         ZnOH4--;
        reductant       OH-;
        CRefOxidant     1000;       
        CRefReductant   1000;        
        gammaOxidant    1;
        gammaReductant  4;
        exchangeCurrentDensity  1e-2;
        equilibriumPotential -0.469;
        electrodePotential  -0.20;
        alphaA          0.5;
        alphaC          0.5;     
        electrons       2;     
    }

    
    //currentCollector
    //{
    //    //type            fixedValue;
    //    //value           uniform (1000.0 0.0 0.0);
    //    type            calculated;
    //}
    

    separator
    {
        //type            calculated;
        type            zeroGradient;
    }
 
    frontAndBack 
    {
        type            empty;
    }
    wall 
    {
        //type            zeroGradient;
        type            fixedValue;
        value           uniform (0.0 0.0 0.0);
    }    
}

// ************************************************************************* //
